## Production: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cache_buster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cache_buster"  {
      ~ id      = "911250128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudfront_distribution.wordpress will be updated in-place
  ~ resource "aws_cloudfront_distribution" "wordpress" {
        id                             = "E1HX1N6D5W92G9"
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ response_headers_policy_id = "c6792be8-122b-4a69-ac98-a94df4559a2f" -> (known after apply)
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }


      ~ ordered_cache_behavior {
          ~ path_pattern               = "/sign-in-se-connecter*" -> "*/sign-in-se-connecter*"
          + response_headers_policy_id = (known after apply)
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          ~ path_pattern               = "wp-admin/*" -> "sign-in-se-connecter*"
          + response_headers_policy_id = (known after apply)
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          ~ allowed_methods            = [
              + "DELETE",
              + "PATCH",
              + "POST",
              + "PUT",
                # (3 unchanged elements hidden)
            ]
          ~ default_ttl                = 86400 -> 0
          ~ max_ttl                    = 31536000 -> 0
          ~ path_pattern               = "/uploads/*" -> "*/wp-admin*"
          + response_headers_policy_id = (known after apply)
          ~ target_origin_id           = "wordpress_uploads" -> "wordpress"
            # (7 unchanged attributes hidden)

          ~ forwarded_values {
              ~ headers                 = [
                  + "Host",
                  + "User-Agent",
                    # (1 unchanged element hidden)
                ]
              ~ query_string            = false -> true
                # (1 unchanged attribute hidden)

              ~ cookies {
                  ~ forward           = "none" -> "all"
                    # (1 unchanged attribute hidden)
                }
            }
        }
      ~ ordered_cache_behavior {
          ~ path_pattern               = "wp-json/*" -> "wp-admin*"
          + response_headers_policy_id = (known after apply)
            # (11 unchanged attributes hidden)

          ~ forwarded_values {
              ~ headers                 = [
                  - "Authorization",
                    # (3 unchanged elements hidden)
                ]
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/uploads/*"
          + target_origin_id       = "wordpress_uploads"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "*/wp-json*"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "wordpress"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Authorization",
                  + "Host",
                  + "Origin",
                  + "User-Agent",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "wp-json*"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "wordpress"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Authorization",
                  + "Host",
                  + "Origin",
                  + "User-Agent",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }

        origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy will be destroyed
  - resource "aws_cloudfront_response_headers_policy" "security_headers_policy" {
      - etag = "E23ZP02F085DFQ" -> null
      - id   = "c6792be8-122b-4a69-ac98-a94df4559a2f" -> null
      - name = "my-security-headers-policy" -> null

      - security_headers_config {

          - content_type_options {
              - override = true -> null
            }

          - frame_options {
              - frame_option = "SAMEORIGIN" -> null
              - override     = true -> null
            }

          - strict_transport_security {
              - access_control_max_age_sec = 31536000 -> null
              - include_subdomains         = true -> null
              - override                   = true -> null
              - preload                    = true -> null
            }

          - xss_protection {
              - mode_block = true -> null
              - override   = true -> null
              - protection = true -> null
            }
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_admin will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy_admin" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "gc-articles-security-headers-admin"

      + security_headers_config {

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "SAMEORIGIN"
              + override     = true
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_api will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy_api" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "gc-articles-security-headers-api"

      + security_headers_config {

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_frontend will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy_frontend" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "gc-articles-security-headers-frontend"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "base-uri 'self'; connect-src 'self'; default-src 'self'; font-src 'self' data: https://fonts.gstatic.com https://use.fontawesome.com https://www.canada.ca; frame-src 'self'; img-src 'self' data: https://canada.ca https://wet-boew.github.io https://www.canada.ca https://secure.gravatar.com; manifest-src 'self'; media-src 'self'; object-src 'none'; script-src 'self' 'sha256-DdN0UNltr41cvBTgBr0owkshPbwM95WknOV9rvTA7pg=' 'sha256-MF5ZCDqcQxsjnFVq0T7A8bpEWUJiuO9Qx1MqSYvCwds=' 'sha256-8//zSBdstORCAlBMo1/Cig3gKc7QlPCh9QfWbRu0OjU=' https://ajax.googleapis.com/ajax/libs/jquery/2.2.4/jquery.js https://www.canada.ca/etc/designs/canada/wet-boew/js/wet-boew.min.js https://www.canada.ca/etc/designs/canada/wet-boew/js/theme.min.js https://www.canada.ca/etc/designs/canada/wet-boew/js/i18n/en.min.js; style-src 'self' 'unsafe-inline' https://use.fontawesome.com https://www.canada.ca; worker-src 'none';"
              + override                = true
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "SAMEORIGIN"
              + override     = true
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_iam_policy.cache_buster will be updated in-place
  ~ resource "aws_iam_policy" "cache_buster" {
        id        = "arn:aws:iam::472286471787:policy/cache_buster"
        name      = "cache_buster"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>